app/Controllers/MainController.php

SELECT *
FROM `playlist`
---
    public function index()
    {
        $currentPlaylistId = $this->request->getVar('playlist_id') ?? 0;
        $searchQuery = $this->request->getGet('search');
        $playlistId = $this->request->getGet('playlist_id');

        if (!empty($playlistId)) {
            $data = $this->fetchPlaylistAndSongs($playlistId);
        } elseif (!empty($searchQuery)) {
            $data = $this->searchSongs($searchQuery);
        } else {
            $data = $this->fetchAllSongs();
        }

        $data['playlists'] = $this->playlist->findAll();

SELECT *
FROM `playlist`
---
    public function playlist($playlistId)
    {
        $data = $this->fetchPlaylistAndSongs($playlistId);
        $data['currentPlaylistId'] = $playlistId;
        $data['playlists'] = $this->playlist->findAll();

SELECT `playlist`.`playlist_id`, `playlist`.`name`, `music`.`music_id`, `music`.`title`, `music`.`artist`, `music`.`album`, `music`.`genre`, `music`.`file_path`
FROM `playlist`
JOIN `playlistmusic` ON `playlistmusic`.`playlist_id` = `playlist`.`playlist_id`
JOIN `Music` ON `music`.`music_id` = `playlistMusic`.`music_id`
WHERE `playlist`.`playlist_id` = '1'
---
    private function fetchPlaylistAndSongs($playlistId)
    {
        $playlist = $this->playlist
            ->select('playlist.playlist_id, playlist.name, music.music_id, music.title, music.artist, music.album, music.genre, music.file_path, playlistmusic.playlist_music_id')
            ->join('playlistmusic', 'playlistmusic.playlist_id = playlist.playlist_id')
            ->join('Music', 'music.music_id = playlistMusic.music_id')
            ->where('playlist.playlist_id', $playlistId)
            ->findAll();